# Команды, которые фронт шлет на сервер 

---

1. **Управление поливом**

{
  "action": "water",
  "data": {
    "state": "1"
  }
}

{
  "action": "water",
  "data": {
    "state": "0"
  }
}
---

2. **Установка порогов**

  - Cистема следит за влажностью почвы
меньше 40 -> почва сухая -> включить полив (water 1)
больше или равно 40 -> нормально -> ничего не делать / можно выключить полив

  - Cистема следит за температурой
больше 30°C -> слишком жарко -> отправить предупреждение / что-то изменить (если есть чем управлять)
меньше или равно 30°C -> нормально -> ничего не делать

(значение указаны рандомно, необходимо согласовывать)

{
  "action": "set_thresholds",
  "data": {
    "moisture": 40,
    "temperature": 30
  }
}

---

3. Запрос данных

ESP должна ответить:
влажность
температура
возможно свет

{
  "action": "get_status"
}

---

4. Что ESP -> сервер
ESP тоже отправляет данные обратно:

{
  "status": "ok",
  "data": {
    "moisture": 35,
    "temperature": 27,
    "water": "1",
    "plant_status": "healthy"
  }
}

---

5. Отправка фото

{
  "action": "upload_image",
  "data": {
    "image": "base64_string_или_url"
  }
}

---

6. Ответ нейросети 

{
  "status": "ok",
  "data": {
    "plant_status": "diseased",
    "confidence": 0.87
  }
}
