Задачи:
1. Обучить первую версию нейросети: отличать живое растение от мертвого/желтого с точностью 20-25%.
2. Подготовить скрипт, который по фото выдает результат (здоров/болен) в формате, согласованном с 1 командой.

Решение:
1) собран и частично размечен датасет
2)Все изображения приведены к размеру 640×640 пикселей
3)Применена аугментация: горизонтальное отражение, поворот на ±15°, регулировка яркости и контраста
4)Нормализация пикселей: /255.0
5) Обучение: на GPU, 50 эпох, начальная скорость 0.001
6) результат - ошибка 21.7 что попадает в диапазон 20-25
7) сделан скрипт под json формат
