# GreenEyeAI-Interface

## Задачи команды:

1. Обучить первую версию нейросети: отличать живое растение от мертвого/желтого с точностью 20-25%.
2. Подготовить скрипт, который по фото выдает результат (здоров/болен) в формате, согласованном с 1 командой.
3. Разработать диаграмму use-case (взаимодействие пользователя с приложением) 
4. Верстка основной страницы:
  -Сделать по макету
  -Пока данные с сервера фейковые (зашить тестовые JSON или т.п.).

**Итог**: Рабочая модель (хоть и плохая) и главная страница.
